# ForegroundPatternColorParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ForegroundPatternColorParam Property
ParameterTypeId Class See Also
---
"Foreground Pattern Color"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ForegroundPatternColorParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ForegroundPatternColorParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ForegroundPatternColorParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace